'''
3-4 嘉宾名单 :如果你可以邀请任何人一起共进晚餐(无论是在世 的还是故去的)，
你会邀请哪些人?请创建一个列表，其中包含 至少3个你想邀请的人;然后，使用这个列表打印消息，邀请这些 人来与你共进晚餐。
'''
list = ['张三','李四','王二麻']
print("我想邀请" + list[0] + "," + list[1] + "," + list[2] + "来我家做客")
'''
3-5 修改嘉宾名单 :你刚得知有位嘉宾无法赴约，因此需要另外邀 请一位嘉宾。
以完成练习3-4时编写的程序为基础，在程序末尾添加一条 print 语句，指出哪位嘉宾无法赴约。
   修改嘉宾名单，将无法赴约的嘉宾的姓名替换为新邀请的嘉
   宾的姓名。
再次打印一系列消息，向名单中的每位嘉宾发出邀请。
'''
list1 = list.pop(1)
print(list1+ '无法来')
list.insert(1, "小明")
print("我想邀请" + list[0] + "," + list[1] + "," + list[2] + "来我家做客")
list.insert(0, '甲')
list.insert(2, "乙")
list.append('丙')
print('我找到了一个更大的餐桌')
print("我想邀请" + list[0] + "," + list[1] + "," + list[2] + "," + list[3] + 
	"," + list[4] + "," + list[5] + "来我家做客")
print("新购买的餐桌无法及时送达，因此只能邀 请两位嘉宾。")
print(list.pop()+"抱歉，无法邀请你来共进晚餐。")
print(list.pop()+"抱歉，无法邀请你来共进晚餐。")
print(list.pop()+"抱歉，无法邀请你来共进晚餐。")
print(list.pop()+"抱歉，无法邀请你来共进晚餐。")
print(list[0] + "依然在受邀人之列")
print(list[1] + "依然在受邀人之列")
print(len(list))
del(list[0])
del(list[0])
print(list)
